package basic

/*
工作区和GOPATH

历史版本
	从 Go 1.5 版本的自举（即用 Go 语言编写程序来实现 Go 语言自身）
	到 Go 1.7 版本的极速 GC（也称垃圾回收器）
	再到 2018 年 2 月发布的 Go 1.10 版本对其自带工具的全面升级
	以及可预见的后续版本关键特性（比如用来做程序依赖管理的go mod命令）
面试问题
	你知道设置 GOPATH 有什么意义吗？
	A：为了集中组织代码，以及代码互相引用
		可以把 GOPATH 简单理解成 Go 语言的工作目录，它的值是一个目录的路径，也可以是多个目录路径
		每个目录都代表 Go 语言的一个工作区（workspace）
		我们需要利用这些工作区，去放置 Go 语言的源码文件（source file），以及安装（install）后的归档文件（archive file，也就是以“.a”为扩展名的文件）和可执行文件（executable file）
		事实上，由于 Go 语言项目在其生命周期内的所有操作（编码、依赖管理、构建、测试、安装等）基本上都是围绕着 GOPATH 和工作区进行的

知识扩展
1. Go 语言源码的组织方式
	代码包
		Go 语言的源码也是以代码包为基本组织单位的
		在文件系统中，这些代码包其实是与目录一一对应的。由于目录可以有子目录，所以代码包也可以有子包
		一个代码包中可以包含任意个以.go 为扩展名的源码文件，这些源码文件都需要被声明属于同一个代码包
		代码包的名称一般会与源码文件所在的目录同名。如果不同名，那么在构建、安装的过程中会以代码包名称为准
		每个代码包都会有导入路径。代码包的导入路径是其他代码在使用该包中的程序实体时，需要引入的路径
	组织方式
		以环境变量 GOPATH、工作区、src 目录和代码包为主线的
		一般情况下，Go 语言的源码文件都需要被存放在环境变量 GOPATH 包含的某个工作区（目录）中的 src 目录下的某个代码包（目录）中
2. 了解源码安装后的结果
	src目录
		源码文件通常会被放在某个工作区的 src 子目录下
	pkg目录
		安装后如果产生了归档文件（以“.a”为扩展名的文件），就会放进该工作区的 pkg 子目录
	bin目录
		如果产生了可执行文件，就可能会放进该工作区的 bin 子目录
	归档文件
		源码文件会以代码包的形式组织起来，一个代码包其实就对应一个目录
		安装某个代码包而产生的归档文件是与这个代码包同名的
		示例
			go install github.com/xxx/golang
			生成的归档文件的相对目录就是 github.com/xxx，文件名为 golang.a
		概念
			归档文件在Linux下就是扩展名是.a的文件，也就是archive文件
			是程序编译后生成的静态库文件
	平台相关目录
		归档文件的相对目录与 pkg 目录之间还有一级目录，叫做平台相关目录
		平台相关目录的名称是由 build（也称“构建”）的目标操作系统、下划线和目标计算架构的代号组成的
	图示
		01.gopath.jpg
3. 理解构建和安装 Go 程序的过程
	构建和安装代码包的时候都会执行编译、打包等操作，并且，这些操作生成的任何文件都会先被保存到某个临时的目录中
	go build 命令
		如果构建的是库源码文件，那么操作的结果文件只会存在于临时目录中
			这里的构建的主要意义在于检查和验证
		如果构建的是命令源码文件，那么操作的结果文件会被搬运到源码文件所在的目录中
	go install 命令
		安装操作会先执行构建，然后还会进行链接操作，并且把结果文件搬运到指定目录
		如果安装的是库源码文件，那么结果文件会被搬运到它所在工作区的 pkg 目录下的某个子目录中
		如果安装的是命令源码文件，那么结果文件会被搬运到它所在工作区的 bin 目录中，或者环境变量GOBIN指向的目录中

总结
	Go 语言提供的很多工具都是在 GOPATH 和工作区的基础上运行的，比如go build、go install和go get
	可以看一下 Go 语言标准库中go build包及其子包的源码

思考
	1.Go 语言在多个工作区中查找依赖包的时候是以怎样的顺序进行的？
	2.如果在多个工作区中都存在导入路径相同的代码包会产生冲突吗？

补充：go build 命令一些可选项的用途和用法
	默认不会编译依赖包
		在运行go build命令的时候，默认不会编译目标代码包所依赖的那些代码包
		当然，如果被依赖的代码包的归档文件不存在，或者源码文件有了变化，那它还是会被编译
	-a
		如果要强制编译依赖的代码包，可以在执行命令的时候加入标记-a
		此时，不但目标代码包总是会被编译，它依赖的代码包也总会被编译，即使依赖的是标准库中的代码包也是如此
	-i
		如果不但要编译依赖的代码包，还要安装它们的归档文件，那么可以加入标记-i
	怎么确定哪些代码包被编译了呢？有两种方法
		1. 运行go build命令时加入标记-x，这样可以看到go build命令具体都执行了哪些操作
			另外也可以加入标记-n，这样可以只查看具体操作而不执行它们
			go build -x -n main.go
		2. 运行go build命令时加入标记-v，这样可以看到go build命令编译的代码包的名称
			它在与-a标记搭配使用时很有用
			go build -v -a main.go
	go get
		命令go get会自动从一些主流公用代码仓库（比如 GitHub）下载目标代码包，并把它们安装到环境变量GOPATH包含的第 1 工作区的相应目录中
		如果存在环境变量GOBIN，那么仅包含命令源码文件的代码包会被安装到GOBIN指向的那个目录
	go get 常用标记
		-u：下载并安装代码包，不论工作区中是否已存在它们
		-d：只下载代码包，不安装代码包
		-fix：在下载代码包后先运行一个用于根据当前 Go 语言版本修正代码的工具，然后再安装代码包
		-t：同时下载测试所需的代码包
		-insecure：允许通过非安全的网络协议下载和安装代码包。HTTP 就是这样的协议
	依赖管理
		Go 语言官方提供的go get命令是比较基础的，其中并没有提供依赖管理的功能
		目前 GitHub 上有很多提供这类功能的第三方工具，比如glide、gb以及官方出品的dep、vgo等等，它们在内部大都会直接使用go get
	自定义代码包导入路径
		有时候，我们可能会出于某种目的变更存储源码的代码仓库或者代码包的相对路径
		这时，为了让代码包的远程导入路径不受此类变更的影响，我们会使用自定义的代码包导入路径
		对代码包的远程导入路径进行自定义的方法：
			在该代码包中的库源码文件的包声明语句的右边加入导入注释
			package semaphore // import "golang.org/x/sync/semaphore"
		释义：假如代码包原本的完整导入路径是github.com/golang/sync/semaphore
			该代码包的源码实际存在 GitHub 网站的 golang 组的 sync 代码仓库的 semaphore 目录下
			加入导入注释后，用以下命令即可下载并安装该代码包
			go get golang.org/x/sync/semaphore
		“真实地址”
			而 Go 语言官网 golang.org 下的路径 /x/sync/semaphore 并不是存放semaphore包的真实地址
			不过，这还需要在 golang.org 这个域名背后的服务端程序上，添加一些支持才能使这条命令成功
		关于自定义代码包导入路径的完整说明可以参看
			https://github.com/hyper0x/go_command_tutorial/blob/master/0.3.md
	Go 语言官方的命令文档
		https://golang.google.cn/cmd/go/
*/
